/* 
  Localizable.strings
  Pages Mail Merger

  Created by Sal Soghoian on 6/18/14.
  Copyright (c) 2014 Nyhthawk Productions. All rights reserved.
*/

"HELP_URL" = "http://iworkautomation.com/pages/script-tags-data-merge.html";

"IMPORT_BUTTON_TITLE" = "Import";
"CHOOSE_BUTTON_TITLE" = "Choose";

"MAIL_FLAG_CHARACTER" = "M";
"NAME_FLAG_CHARACTER" = "N";

"DEFAULT_FOLDER_BUTTON_TOOLTIP" = "No folder has been selected";

/* POPUP TAG MENU ITEMS */
"SELECT_PLACHOLDER_MENU_TITLE" = "Choose tag for selected table item…";
"REMOVE_PLACHOLDER_MENU_TITLE" = "Clear placeholder tag assignment…";
"DEFAULT_PLACEHOLDER_MENU_TITLE" = "No placeholder tags";
"MAIL_PLACHOLDER_MENU_TITLE" = "Assign as email recipient address…";
"REMOVE_MAIL_ASSIGNMENT_MENU_TITLE" = "Clear email recipient assignment…";
"NAME_FLAG_MENU_TITLE" = "Assign for use with file naming…";
"REMOVE_NAME_FLAG_MENU_TITLE" = "Clear file naming assignment…";


"CSV_IMPORT_DIALOG_PROMPT" = "Choose the CSV (comma separated values) file containing the data to be merged:";
"CSV_IMPORT_DIALOG_TITLE" = "Choose Data File (CSV)";
"TSV_IMPORT_DIALOG_PROMPT" = "Choose the TSV (tab separated values) file containing the data to be merged:";
"TSV_IMPORT_DIALOG_TITLE" = "Choose Data File (TSV)";

"NO_DATA_ITEM_SELECTED_TITLE" = "Selection Error";
"NO_DATA_ITEM_SELECTED_MESSAGE" = "Please select a data record item before attempting to assign or unassign a Pages placeholder tag.";

"MAILFLAG_NO_DATA_ITEM_SELECTED_TITLE" = "Selection Error";
"MAILFLAG_NO_DATA_ITEM_SELECTED_MESSAGE" = "Please select a data record item before attempting to assign or un-assign it as the target email address.";

"NAMEFLAG_NO_DATA_ITEM_SELECTED_TITLE" = "Selection Error";
"NAMEFLAG_NO_DATA_ITEM_SELECTED_MESSAGE" = "Please select a data record item before attempting to assign or un-assign it for use with naming exported files.";

"CONFIRM_MAIL_SETUP_TITLE" = "Mail Attachments";
"CONFIRM_MAIL_SETUP_MESSAGE" = "Do you want to attach the exported items to individual outgoing Mail messages?\n\nTo enable this option, click the “Yes” button on this sheet, select the data item to be used as the recipient address, and then select “Assign as email recipient address…” from the tag assignment popup menu (2).";

"CONFIRM_MAIL_TEARDOWN_TITLE" = "Mail Attachments";
"CONFIRM_MAIL_TEARDOWN_MESSAGE" = "Do you want to change the current setting so that the exported items will no longer be attached to individual outgoing Mail messages?";

"CONFIRM_MAIL_AFFIRMATIVE_BUTTON_TITLE" = "Yes";
"CONFIRM_MAIL_NEGATIVE_BUTTON_TITLE" = "No";

"TARGET_EMAIL_ADDRESS_TAG" = "TARGET-EMAIL-ADDRESS";

"PAGES_NOT_RUNNING_ERROR_TITLE" = "MISSING RESOURCE";
"PAGES_NOT_RUNNING_ERROR_MESSAGE" = "The Pages application is not running.\n\nPlease launch the Pages application and open the document to merge and export.";

"DOCUMENT_HAS_NO_TAGS_TITLE" = "MISSING PLACEHOLDERS";
"DOCUMENT_HAS_NO_TAGS_MESSAGE" = "The front Pages document does not contain any text placeholders.";

"PROBLEM_GETTING_PLACEHOLDER_TAGS_TITLE" = "READ ERROR";
"PROBLEM_GETTING_PLACEHOLDER_TAGS_MESSAGE" = "There was a problem getting the placeholder tags from the front Pages document.";

"CONFIRM_CLEAR_DATA_BUTTON_TITLE" = "Yes";
"CONFIRM_CLEAR_DATA_NEGATIVE_BUTTON_TITLE" = "No";
"CONFIRM_CLEAR_DATA_TITLE" = "CONFIRM DELETION";
"CONFIRM_CLEAR_DATA_MESSAGE" = "Are you sure you want to delete the imported data and assignments? This action cannot be undone.";

"READ_DATA_ERROR_TITLE" = "DATA READ ERROR";
"READ_DATA_ERROR_MESSAGE" = "There was a problem reading the indicated data.";
"READ_DATA_ERROR_AFFIRMATIVE_BUTTON_TITLE" = "OK";
"READ_DATA_ERROR_NEGATIVE_BUTTON_TITLE" = "Cancel";

"NO_DATA_PROVIDED_TITLE" = "MISSING DATA";
"NO_DATA_PROVIDED_MESSAGE" = "The import table contains no imported data.";
"NO_DATA_PROVIDED_BUTTON_TITLE" = "Cancel";

"NO_ASSIGNED_TAGS_TITLE" = "MISSING TAGS";
"NO_ASSIGNED_TAGS_MESSAGE" = "The import table contains no assigned placeholder tags.";
"NO_ASSIGNED_TAGS_BUTTON_TITLE" = "Cancel";

"REQUEST_BEGIN_OK_BUTTON_TITLE" = "Begin";
"REQUEST_BEGIN_NO_BUTTON_TITLE" = "Cancel";
"REQUEST_BEGIN_TITLE" = "PLEASE CONFIRM";
"REQUEST_BEGIN_MESSAGE" = "Do you want to perform a data merge using the front Pages document?";

"CANCEL_BUTTON_TITLE" = "Cancel";
"OK_BUTTON_TITLE" = "OK";

"ERROR_1000_TITLE" = "MISSING RESOURCE";
"ERROR_1000_MESSAGE" = "There is no open Pages document.";
"ERROR_1001_TITLE" = "MISSING PLACEHOLDERS";
"ERROR_1001_MESSAGE" = "The frontmost Pages document contains no text placeholders.";

"COMPLETION_TITLE" = "COMPLETION";
"COMPLETION_MESSAGE" = "The provided data has been merged into exported documents.";
"COMPLETION_BUTTON_TITLE" = "OK";
"COMPLETION_ALTERNATE_BUTTON_TITLE" = "Show";

"DEFAULT_FOLDER_NAME" = "Pages Data Merge";

"FOLDER_CHOOSE_DIALOG_TITLE" = "Choose Export Folder";
"FOLDER_CHOOSE_DIALOG_PROMPT" = "Select the folder in which to create an export output folder:";

"PLIST_CHOOSE_DIALOG_TITLE" = "Choose Data Parings Snapshot";
"PLIST_CHOOSE_DIALOG_PROMPT" = "Choose the data pairings property list to use with the current data set:";

"NO_FOLDER_CHOSEN_TITLE" = "EXPORT FOLDER ISSUE";
"NO_FOLDER_CHOSEN_MESSAGE" = "No export folder was chosen.\n\nClick the “Choose Export Folder” button and select an export folder.";
"NO_FOLDER_CHOSEN_BUTTON_TITLE" = "Cancel";

"NUMBERS_ERROR_TITLE" = "NUMBERS ERROR";
"MISSING_NUMBERS_DOCUMENT_ERROR_TITLE" = "MISSING RESOURCE";
"MISSING_NUMBERS_DOCUMENT_ERROR_MESSAGE" = "There is no document open in the Numbers application.";
"NO_SELECTED_TABLE_ERROR_TITLE" = "SELECTION ERROR";
"NO_SELECTED_TABLE_ERROR_MESSAGE" = "Please select a range of cells on a Numbers table before attempting import.";

"MISSING_PASSWORD_TITLE" = "MISSING PASSWORD";
"MISSING_PASSWORD_MESSAGE" = "An exncrypted format was chosen for the output file but no password has been provided.\n\nPlease enter a password by clicking the “Set Password” button.";
"MISSING_PASSWORD_BUTTON_TITLE" = "Cancel";

"NO_ASSIGNED_EMAIL_ADDRESS_TITLE" = "MISSING RECIPIENT ADDRESS";
"NO_ASSIGNED_EMAIL_ADDRESS_MESSAGE" = "The chosen settings are to attach the exported document to outgoing email messages but no recipient address has been provided.\n\nSelect the data item containing the recipient address and then select “Assign as email recipient address…” from the tag assignment popup menu.";
"NO_ASSIGNED_EMAIL_ADDRESS_BUTTON_TITLE" = "Cancel";

"MISSING_MAIL_SUBJECT_TITLE" = "MISSING MAIL MESSAGE SUBJECT";
"MISSING_MAIL_SUBJECT_MESSAGE" = "The chosen settings are to attach the exported document to outgoing email messages but no subject for the outgoing messages was entered.\n\nPlease enter a subject in the “Subject” text input field.";
"MISSING_MAIL_SUBJECT_BUTTON_TITLE" = "Cancel";
